---
title: RebarCouplerFailures
classe: Autodesk.Revit.DB.BuiltInFailures+RebarCouplerFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 20
---

# RebarCouplerFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CantKeepConstraintsToBars { get; }` | `RebarCouplerFailures.CantKeepConstraintsToBars` | FailureDefinitionId |
| `FailureDefinitionId CouplerRequiredRemoveFromGroup { get; }` | `RebarCouplerFailures.CouplerRequiredRemoveFromGroup` | FailureDefinitionId |
| `FailureDefinitionId CouplerTypeInvalid { get; }` | `RebarCouplerFailures.CouplerTypeInvalid` | FailureDefinitionId |
| `FailureDefinitionId DisconnectElements { get; }` | `RebarCouplerFailures.DisconnectElements` | FailureDefinitionId |
| `FailureDefinitionId DistanceBetweenBarsError { get; }` | `RebarCouplerFailures.DistanceBetweenBarsError` | FailureDefinitionId |
| `FailureDefinitionId DistanceBetweenBarsWarning { get; }` | `RebarCouplerFailures.DistanceBetweenBarsWarning` | FailureDefinitionId |
| `FailureDefinitionId EngagementBiggerThanLengthError { get; }` | `RebarCouplerFailures.EngagementBiggerThanLengthError` | FailureDefinitionId |
| `FailureDefinitionId EngagementBiggerThanLengthWarning { get; }` | `RebarCouplerFailures.EngagementBiggerThanLengthWarning` | FailureDefinitionId |
| `FailureDefinitionId LengthParameterError { get; }` | `RebarCouplerFailures.LengthParameterError` | FailureDefinitionId |
| `FailureDefinitionId LengthParameterWarning { get; }` | `RebarCouplerFailures.LengthParameterWarning` | FailureDefinitionId |
| `FailureDefinitionId MainEngagementParameterError { get; }` | `RebarCouplerFailures.MainEngagementParameterError` | FailureDefinitionId |
| `FailureDefinitionId MainEngagementParameterWarning { get; }` | `RebarCouplerFailures.MainEngagementParameterWarning` | FailureDefinitionId |
| `FailureDefinitionId NewCouplerTypeCreated { get; }` | `RebarCouplerFailures.NewCouplerTypeCreated` | FailureDefinitionId |
| `FailureDefinitionId NoBarSizeError { get; }` | `RebarCouplerFailures.NoBarSizeError` | FailureDefinitionId |
| `FailureDefinitionId NoBarSizeWarning { get; }` | `RebarCouplerFailures.NoBarSizeWarning` | FailureDefinitionId |
| `FailureDefinitionId NoTypeParamsDefinedWarning { get; }` | `RebarCouplerFailures.NoTypeParamsDefinedWarning` | FailureDefinitionId |
| `FailureDefinitionId SecondaryEngagementParameterError { get; }` | `RebarCouplerFailures.SecondaryEngagementParameterError` | FailureDefinitionId |
| `FailureDefinitionId SecondaryEngagementParameterWarning { get; }` | `RebarCouplerFailures.SecondaryEngagementParameterWarning` | FailureDefinitionId |
| `FailureDefinitionId WidthParameterError { get; }` | `RebarCouplerFailures.WidthParameterError` | FailureDefinitionId |
| `FailureDefinitionId WidthParameterWarning { get; }` | `RebarCouplerFailures.WidthParameterWarning` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```